
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПостроитьГрафикНаСервере();	
	
КонецПроцедуры

&НаСервере
Процедура ПостроитьГрафикНаСервере()
	
	ГрафикВеса.Очистить();
	
	ГрафикВеса.БазовоеЗначение = 40;
	ГрафикВеса.АвтоМаксимальноеЗначение = Ложь;
	ГрафикВеса.МаксимальноеЗначение = 120;
	ГрафикВеса.АвтоМинимальноеЗначение = Ложь;
	ГрафикВеса.МинимальноеЗначение = 40;
	
	Серия = ГрафикВеса.Серии.Добавить("Вес");
	ДанныеВеса = ПолучитьДанныеРегистраВеса();
	
	Пока ДанныеВеса.Следующий() Цикл
			
		Точка = ГрафикВеса.УстановитьТочку(Формат(ДанныеВеса.Дата,"ДФ=dd.MM.yyyy"));
		ГрафикВеса.УстановитьЗначение(Точка, Серия, ДанныеВеса.Вес);
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеРегистраВеса()
		
	ТекДата = ТекущаяДатаСеанса();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Период КАК Дата,
		|	Вес КАК Вес
		|ИЗ
		|	РегистрСведений.Вес КАК Вес
		|ГДЕ
		|	Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	
	Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекДата));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ТекДата));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Выбрать();
			
КонецФункции

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	ПостроитьГрафикНаСервере();
КонецПроцедуры
