#Область  ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПитаниеТаблицаПитания.Продукт КАК Продукт,
		|	СУММА(ПитаниеТаблицаПитания.КоличествоКалорий) КАК КоличествоКалорий,
		|	ПитаниеТаблицаПитания.Ссылка.Дата КАК Период,
		|	ПитаниеТаблицаПитания.Ссылка.ВремяДня КАК ВремяДня
		|ИЗ
		|	Документ.Питание.ТаблицаПитания КАК ПитаниеТаблицаПитания
		|ГДЕ
		|	ПитаниеТаблицаПитания.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПитаниеТаблицаПитания.Продукт,
		|	ПитаниеТаблицаПитания.Ссылка.Дата,
		|	ПитаниеТаблицаПитания.Ссылка.ВремяДня";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.Калории.Записывать = Истина;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Движение = Движения.Калории.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи);
			
	КонецЦикла;
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Калории = ТаблицаПитания.Итог("КоличествоКалорий");
		
КонецПроцедуры


#КонецОбласти