
&НаКлиенте
Процедура ТаблицаПитанияПродуктПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	КалорийностьПродукта = ПолучитьКалорийностьПродукта(ТекДанные.Продукт);
	ТекДанные.КалорийностьПродукта = КалорийностьПродукта;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКалорийностьПродукта(Продукт)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Продукты.КалорийностьПродукта КАК КалорийностьПродукта
		|ИЗ
		|	Справочник.Продукты КАК Продукты
		|ГДЕ
		|	Продукты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Продукт);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.КалорийностьПродукта;
	
КонецФункции

&НаКлиенте
Процедура ТаблицаПитанияМассаПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	ТекДанные.КоличествоКалорий = Окр((ТекДанные.Масса * ТекДанные.КалорийностьПродукта) / 100);
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаПитанияКоличествоКалорийПриИзменении(Элемент)
	
	ТекДанные = Элементы.ТаблицаПитания.ТекущиеДанные;
	ТекДанные.Масса = ?(ТекДанные.КалорийностьПродукта = 0, 0, Окр((ТекДанные.КоличествоКалорий * 100) / ТекДанные.КалорийностьПродукта));
	
КонецПроцедуры

